# Ч Restablecer configuraci贸n en Router y Switch Cisco

Gu铆a r谩pida para **borrar completamente la configuraci贸n existente** en equipos Cisco (routers y switches), 煤til para iniciar desde cero en laboratorios o reconfiguraciones.

---

##  1. Borrar configuraci贸n en un **Router Cisco**

###  Pasos

1. Con茅ctate al router por **consola serial** usando PuTTY, TeraTerm o similar.
2. Ingresa al modo privilegiado:

```
Router> enable
```

3. Borra la configuraci贸n guardada en NVRAM:

```
Router# write erase
```

o alternativamente:

`Router# erase startup-config`

4. (Opcional) Verifica que se haya borrado:

```
Router# show startup-config
```

Debe mostrar una configuraci贸n vac铆a o inexistente.

5. Reinicia el router para aplicar los cambios:

```
Router# reload
```

Cuando pregunte si deseas guardar la configuraci贸n, responde:

`no`

6. El router se reiniciar谩 como si fuera nuevo, mostrando el di谩logo de configuraci贸n inicial:

Would you like to enter the initial configuration dialog? [yes/no]:

---

## О 2. Borrar configuraci贸n en un **Switch Cisco**

###  Pasos

1. Con茅ctate al switch por consola.
2. Ingresa al modo privilegiado:

```
Switch> enable
```

3. Borra la configuraci贸n almacenada:

```
Switch# write erase
```

o:

```
Switch# erase startup-config
```

4. Borra tambi茅n el archivo de VLANs (muy importante):

```
Switch# delete flash:vlan.dat
```

Confirma cuando lo pida:

```
Delete filename [vlan.dat]? [confirm]
```

5. Verifica que los archivos fueron eliminados:

```
Switch# dir flash:
```

6. Reinicia el switch:

```
Switch# reload
```

Cuando pregunte si deseas guardar la configuraci贸n, responde:

```
no
```

7. Al iniciar nuevamente, el switch estar谩 limpio, sin configuraciones previas ni VLANs personalizadas.

---

## 锔 Notas importantes

- El comando `write erase` borra la **configuraci贸n de arranque (startup-config)**.
- El archivo `vlan.dat` almacena las **VLAN creadas manualmente** y no se borra con `write erase`.
- Despu茅s del reinicio, el equipo se comporta como si fuera **nuevo de f谩brica**.
- No es necesario usar `confreg` o `ROMMON` para este proceso si simplemente se desea borrar la configuraci贸n.

---

##  Resultado final esperado

Al reiniciar el dispositivo, deber铆as ver:

```
--- System Configuration Dialog ---
Would you like to enter the initial configuration dialog? [yes/no]:

```

Esto confirma que la configuraci贸n fue completamente eliminada y el router/switch est谩 listo para ser configurado nuevamente.
